# Правила экзамена, не списовать, не оглядываться по сторонам!
# Пишем ответы на вопросы и приводим пример кода.



# 1-й вопрос: Что такое функция в Python?

# Ответ:
# Пример кода:



# 2-й вопрос: Как объявить функцию в Python?

# Ответ:
# Пример кода:



# 3-й вопрос: Как передать аргументы в функцию?

# Ответ:
# Пример кода:



# 4-й вопрос: Что такое аргументы по умолчанию и как их использовать в функции?

# Ответ:
# Пример кода:



# 5-й вопрос: В чем разница между операторами return и print внутри функции?

# Ответ:
# Пример кода:



# 6-й вопрос: Что такое класс в Python и для чего он используется?

# Ответ:
# Пример кода:



# 7-й вопрос: Как объявить класс в Python?

# Ответ:
# Пример кода:



# 8-й вопрос: Как создать экземпляр класса (объект)?

# Ответ:
# Пример кода:



# 9-й вопрос: Какие встроенные методы классов существуют в Python?

# Ответ:
# Пример кода:



# 10-й вопрос: Как создать конструктор класса и зачем он нужен?

# Ответ:
# Пример кода:



# 11-й Мини-проект: Угадай число

# Цель проекта: Создать интерактивную игру, в которой пользователь должен угадать загаданное компьютером число.

# Требования к проекту:

# 1.Компьютер выбирает случайное число от 1 до 100, которое пользователь должен угадать.
# 2.Пользователь получает подсказки, если его предположение оказывается неправильным (например, ""Слишком маленькое"" или ""Слишком большое"").
# 3.Игра продолжается, пока пользователь не угадает число или не решит выйти из игры.

# Примерная структура классов:

# Класс ""GuessGame"": Главный класс, управляющий игрой. Содержит методы для выбора случайного числа, сравнения введенного числа с загаданным и вывода подсказок.

# Примерный ход работы программы:

# - Добро пожаловать в игру ""Угадай число""!

# - Попробуйте угадать число от 1 до 100.

# - Введите ваше предположение: 50
# - Слишком маленькое!

# - Введите ваше предположение: 75
# - Слишком большое!

# - Введите ваше предположение: 63
# - Поздравляем! Вы угадали число 63 за 3 попытки.

# - Хотите сыграть еще? (да/нет): нет
# - Спасибо за игру! До свидания!
