#Правила экзамена, нельзя двигаться, нельзя смотреть по сторонам!
# Пишем ответы на вопросы и приводим примеры на Python!


# Вопрос 1: Как создать пустой список и кортеж в Python?

# Ответь:
# Пример кода:


# Вопрос 2: Как получить длину списка в Python?

# Ответь:
# Пример кода:


# Вопрос 3: Как добавить элемент в конец списка?

# Ответь:
# Пример кода:


# Вопрос 4: Как изменить значение элемента по заданному индексу в списке и кортеже?

# Ответь:
# Пример кода:


# Вопрос 5: Что такое словарь (dict) в Python?

# Ответь:
# Пример кода:


# Вопрос 6: Как добавлять и удалять элементы в словаре?

# Ответь:
# Пример кода:


# Вопрос 7: Как получить значение из словаря по определенному ключу?

# Ответь:
# Пример кода:

################ Ниже приведены примеры, не обязательно писать ответ, просто напишите код! ################

# Вопрос 8: Напишите функцию, которая принимает в качестве аргумента одно число и возвращает, является ли это число четным или нечетным.
# Пример кода:

# Вопрос 9: Создайте список из 10 чисел. И напишите функцию, которая принимает этот список в качестве аргумента.
# Его задача — вернуть сумму четных чисел в этом списке, используя for
# Пример кода:


# Вопрос 10: Создайте новый пустой список и в цикле случайным образом добавляйте к нему числа.
# Когда эти числа равны 10, используйте перерыв или продолжайте останавливать цикл и отображать список
# Пример кода:


# БОНУСНЫЙ ВОПРОС
# Задание: "Игра Найди числа"
# — Напишите функцию «guess_number_game()», которая генерирует случайное число от 1 до 100.
# - Попросите пользователя угадать число с помощью `input()` и пока он не угадает число
# Ответьте что-нибудь вроде: «Число, которое вы считаете маленьким» или «Число, которое вы считаете большим». Когда вы найдете игру, ответьте «Верно» и позвольте циклу остановиться.
# - Возвращает количество попыток, которые пользователь потратил, чтобы угадать число в результате.
