# Правила экзамена, не списовать, не оглядываться по сторонам!
# Пишем ответы на вопросы и приводим пример кода


# 1-й вопрос: print() это...

# Ответ:
# Пример кода:


# 2-й вопрос: input() это...

# Ответ:
# Пример кода:


# 3-й вопрос: Что такое переменная?

# Ответ:
# Пример кода:


# 4-й вопрос: Перечислите 4 типы данных и привидите пример:

# Ответ:
# Пример кода:


# 5-й вопрос: Что такое форматирование строк и привидите пример с двумя методами форматирования в Python:

# Ответ:
# Пример кода:


# 6-й вопрос: Для чего нужны if, elif, else и привидите пример с ними:

# Ответ:
# Пример кода:


# 7-й вопрос: Перечислите операторы сравнения и привидите пример с ними:

# Ответ:
# Пример кода:


# 8-й вопрос: Как работают логические операторы and, not, or и привидите пример с ними:

# Ответ:
# Пример кода:


# 9-й вопрос: Что такой цикл и как работает цикл while:

# Ответ:
# Пример кода:


# 10-й вопрос: Чем отличаеться цикл for от while и привидите пример:

# Ответ:
# Пример кода:


# Теперь нужно сдлеать игру: камень, ножницы, бумага.
# То есть нужно сделать так что бы два игрока могли играть в эту игру, удачи!

